app/views/chatbot_statements/new.html.erb

      <%= a.label :bot_response %><br />
      <%= a.select :response, options_for_select(ChatbotStatement.all.collect { |statement|
        [statement.message, statement.message]
      }), id: 'response_one' %>
---
SELECT "chatbot_statements".* FROM "chatbot_statements"