app/views/chatbot_statements/tree.html.erb

    <ul>
    <% statement.user_answers.each do |answer| %>
---
SELECT "user_answers".* FROM "user_answers" WHERE "user_answers"."chatbot_statement_id" = ?  [["chatbot_statement_id", 1]]