app/controllers/clearance/users_controller.rb

  def create
    @user = user_from_params

    if @user.save
---
INSERT INTO "users" ("created_at", "updated_at", "name", "email", "encrypted_password", "remember_token") VALUES (?, ?, ?, ?, ?, ?)