app/controllers/chatbot_statements_controller.rb

  def view
    @statements = ChatbotStatement.all
---
SELECT "chatbot_statements".* FROM "chatbot_statements"