app/controllers/chatbot_statements_controller.rb

INSERT INTO "chatbot_statements" ("message", "created_at", "updated_at", "status") VALUES (?, ?, ?, ?)  [["message", "Yeahhh this has been added!"], ["created_at", "2017-07-12 06:19:47.909915"], ["updated_at", "2017-07-12 06:19:47.909915"], ["status", "pass"]]
---
  def create
    @statement = ChatbotStatement.create(statement_params)

SELECT "chatbot_statements".* FROM "chatbot_statements"
---
  def remove
    @statements = ChatbotStatement.all

SELECT  "chatbot_statements".* FROM "chatbot_statements" WHERE "chatbot_statements"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "chatbot_statements" WHERE "chatbot_statements"."id" = ?  [["id", 2]]
---
  def destroy
     @statement = ChatbotStatement.find params[:id]
     @statement.destroy

SELECT "chatbot_statements".* FROM "chatbot_statements"
---
  def chatroom
    load_default_conversation if missing_statements?
    @statements = ChatbotStatement.all

INSERT INTO "chatbot_statements" ("message", "created_at", "updated_at", "status") VALUES (?, ?, ?, ?)  [["message", "...Literally more than anything! :D"], ["created_at", "2017-07-12 13:20:53.631979"], ["updated_at", "2017-07-12 13:20:53.631979"], ["status", "pass"]]
INSERT INTO "user_answers" ("message", "chatbot_statement_id", "created_at", "updated_at", "response") VALUES (?, ?, ?, ?, ?)  [["message", "How's it going?"], ["chatbot_statement_id", 1], ["created_at", "2017-07-12 10:09:12.981783"], ["updated_at", "2017-07-12 10:09:12.981783"], ["response", "Not too bad. You?"]]
---
  def load_default_conversation
    statement = ChatbotStatement.create(message: 'Hey!')
    UserAnswer.create(
      message: "How's it going?",
      response: "Not too bad. You?",
      chatbot_statement_id: statement.id
    )