app/controllers/user_answers_controller.rb

  def message
    @answer = UserAnswer.find_by_message(params[:message]).response
    @statement = ChatbotStatement.find_by_message(@answer)
---
SELECT  "user_answers".* FROM "user_answers" WHERE "user_answers"."message" = ? LIMIT ?  [["message", "Hi"], ["LIMIT", 1]]
SELECT  "chatbot_statements".* FROM "chatbot_statements" WHERE "chatbot_statements"."message" = ? LIMIT ?  [["message", "Not too bad. You?"], ["LIMIT", 1]]